import { Container, Text } from '../build';
export default () => {
  return (
    <Container pa='1em'>
      <h2>#什么是 xxx？</h2>
      <Text>
        xxx是一个使用React创建的 UI 组件框架， 可以轻松地制作项目并具有独特而令人愉悦的风格，
        xxx是从头开始创建的，专为从前端爱好者以及想要轻松为最终用户创建视觉方法的后端开发人员设计。
        我们专注于通过提供完整创建的组件并具有独立定制且非常易于实施来简化程序员的工作，
        因此创造力掌握在我们手中，但我们不会忽视每个项目在视觉和生态系统中都是不同的， xxx 没有像其他基于 Material
        Design, Antd 的组件框架那样的设计线， 我们相信已经存在在视觉和 UI / UX
        中看起来很牛逼的框架，但我们不希望成为其中的一个.我们喜欢创造和设计新的体验，
        并用新的元素或细节给你惊喜，我们只能通过视觉上的自由来做到这一点。
      </Text>{' '}
      <h2>#为什么选择？</h2>
      <div>
        xxx 是一个相对较新的框架，具有令人耳目一新的设计和最新趋势， 基于 React 的 xxx 这意味着我们拥有世界上最流行的
        javascript 框架之一并拥有一个庞大的社区，您将拥有一切创建和制作项目的帮助和文档
      </div>
      <li>
        xxx与许多框架不同，它是从头开始设计的，我们没有锚定任何设计路线，这是一件很棒的事情，
        因为您的项目将是独一无二的，并且与其他项目非常不同
      </li>
      <li>我们专注于快速轻松地创建项目，提供美丽的视觉线条，但不会忘记开发人员的个性化和独立性</li>
      <li>
        使用原生 css 变量来实现更好的定制和生产更改，例如更改为深色主题或使用少量 javascript 行更改整个应用程序的主颜色
      </li>
      <li>xxx 是一款旨在具有出色视觉冲击力的框架，并且在设计方面始终处于趋势之中</li>
      <li>一个开源社区，用于创建、改进和纠正任何组件或功能。 </li>
      <li>独立组件，避免导入不必要的代码。 </li>
      <li>Markdown 文档以实现更好的可持续性。 </li>
      <h2>#这个怎么运作？</h2>
      xxx是一个 UI
      组件框架，您可以在您的应用程序或项目中使用它，并为您节省大量时间和自己创建它们的工作，这些组件被创建为可定制和可重用的，因此您可以在任何地方和合乎逻辑地使用它们。
      <h2>#特征</h2>
      <li>模块化：您可以使用所有组件或仅按需使用一个，从而节省不必要的代码并减轻整个框架的重量</li>
      <li>
        快速创建：使用 xxx 快速创建 Web
        应用程序，因为所有困难的工作都为您完成，只需添加一个组件，您就可以在项目中拥有美观且功能强大的元素
      </li>
      <li>轻松上手：您无需成为 react 或 javascript 专家即可在项目中实现 xxx 或其组件</li>
      <li>
        独特的设计：您的项目是独一无二的吗？xxx
        知道它是，这就是为什么它也是独一无二的，所以你不等于其他项目，一切都是一样的
      </li>
      <li>独特的组件：xxx 中有一些您在其他框架中找不到的组件，因为我们有独特的设计，因此可以自由地创造新的用户体验</li>
    </Container>
  );
};
