import { Container, Text } from '../build';
export default () => {
  return (
    <Container>
      <h2>#什么是 Vuesax？</h2>
      <Text>
        Vuesax（发音/vjusacksː/，as view sacks）是一个使用Vuejs创建的 UI 组件框架，
        可以轻松地制作项目并具有独特而令人愉悦的风格，vuesax
        是从头开始创建的，专为从前端爱好者到前端爱好者的所有类型的开发人员设计。想要轻松为最终用户创建视觉方法的后端
        我们专注于通过提供完整创建的组件并具有独立定制且非常易于实施来简化程序员的工作，因此创造力掌握在我们手中，但我们不会忽视每个项目在视觉和生态系统中都是不同的
        Vuesax 没有像其他基于 Material Design 的组件框架那样的设计线，我们相信已经存在在视觉和 UI / UX
        中看起来很瘦弱的框架，除此之外，我们不希望成为其中的一个我们喜欢创造和设计新的体验，并用新的元素或细节给你惊喜，我们只能通过视觉上的自由来做到这一点。
      </Text>{' '}
      <h2>#为什么选择？</h2>
    </Container>
  );
};
